package book.chapter13;

public class JDBCSolver {
    /*
    * TODO:
    * В каждом из заданий необходимо выполнить следующие действия:
    * * организацию соединения с базой данных вынести в отдельный класс, метод
    * которого возвращает соединение;
    * * создать БД. Привести таблицы к одной из нормальных форм;
    * * создать класс для выполнения запросов на извлечение информации из БД
    * с использованием компилированных запросов;
    * * создать класс на модификацию информации.
    * */

    /*
    * [1]
    * Файловая система. В БД хранится информация о дереве каталогов файловой
    * системы — каталоги, подкаталоги, файлы.
    *
    * Для каталогов необходимо хранить:
    * * родительский каталог;
    * * название.
    *
    * Для файлов необходимо хранить:
    * * родительский каталог;
    * * название;
    * * место, занимаемое на диске.
    *
    * Определить полный путь заданного файла (каталога).
    * Подсчитать количество файлов в заданном каталоге, включая вложенные
    * файлы и каталоги.
    * Подсчитать количество файлов в заданном каталоге, включая вложенные
    * файлы и каталоги.
    * Найти в базе файлы по заданной маске с выдачей полного пути.
    * Переместить файлы и подкаталоги из одного каталога в другой.
    * Удалить файлы и каталоги заданного каталога.
    * */
}
