package book.chapter14;

public class SocketSolver {
    /*
     * Вариант А
     * */

    /*
     * [1]
     * Клиент посылает через сервер сообщение другому клиенту,
     * выбранному из списка.
     * */

    /*
     * [2]
     * Чат. Клиент посылает через сервер сообщение, которое
     * получают все клиенты. Список клиентов хранится на сервере в файле.
     * */

    /*
     * [3]
     * Клиент при обращении к серверу получает случайно выбранное
     * стихотворение Максима Богдановича из файла.
     * */

    /*
     * [4]
     * Сервер рассылает сообщения выбранным из списка клиентам.
     * Список клиентов хранится в файле.
     * */

    /*
     * [5]
     * Сервер рассылает сообщения в определенное время определенным клиентам.
     * */

    /*
     * [6]
     * Сервер рассылает сообщения только тем клиентам, которые в настоящий
     * момент находятся в online.
     * */

    /*
     * [7]
     * Чат. Сервер рассылает всем клиентам информацию о клиентах, вошедших
     * в чат и покинувших его.
     * */

    /*
     * [8]
     * Клиент выбирает изображение из списка и пересылает его другому клиенту
     * через сервер.
     * */


    /*
     * Вариант B
     * */

    /*
     * [1]
     * Игра по сети в «Морской бой».
     * */

    /*
     * [2]
     * Игра по сети «Го». Крестики-нолики на безразмерном (большом) поле.
     * Для победы необходимо выстроить пять в один ряд
     * */

    /*
    * [3]
    * Написать программу, сканирующую сеть в указанном диапазоне
    * IP-адресов на наличие активных компьютеров
    * */

    /*
    * [4]
    * Прокси. Программа должна принимать сообщения от любого клиента,
    * работающего на протоколе TCP, и отсылать их на соответствующий
    * сервер. При передаче изменять сообщение.
    * */

    /*
    * [5]
    * Создать консольное приложение-калькулятор, используя
    * вычислительную среду Google Sheets.
    * */

    /*
    * [6]
    * С помощью Google Slides API вывести статистику по заданной
    * презентации, название презентации, локаль текста презентации, размер
    * слайдов, количество слайдов, количество элементов на каждом слайде;
    * задать новое название презентации, изменить размер слайдов.
    * */
}
